
# Створіть функцію def remove_duplicates(array) яка приймає цілочисельний масив,
# відсортований у порядку зростання, видаліть дублікати чисел, щоб кожен унікальний елемент
# з’являвся лише один раз. Функція має повертати новий масив без дуплікатів чисел,
# відносний порядок елементів має бути незмінним
#
# Тестувати функцію ви можете як завгодно: за допомогою модуля sys і аргументів програми,
# або за допомогою input() або в результаті викликів функції. Але в файлі remove_duplicates.py
# повина бути створена функція def remove_duplicates(array) яка виконує необхідну логіку.
#
# Приклади:
#
# remove_duplicates([1,1,2]) -> [1,2]
# remove_duplicates([0,0,1,1,1,2,2,3,3,4]) -> [0,1,2,3,4]
# remove_duplicates([1,1,1,1,1,1,1,1]) -> [1]

def remove_duplicates(list):
    list = [0,0,1,1,1,2,2,3,3,4]
    newlist = []
    if list[i]==list[i+1]:
        newlist.append[i]
    else:
        print(newlist)
    return newlist